README.org
#+TITLE: WebCapture

Org-mode capture templates from wherever.

** Running
*** Prerequisites
- ruby/bundler (developed and tested against ruby-2.2.0)
- node/npm     (developed and tested against npm-3.4.1)

*** Setup (API)
1. ~$ bundle install~
   - this can fail if you don't have postgres installed, try removing ~pg~ from the Gemfile, and edit ~config/database.yml~ to be sqlite, or whatever.
1. Edit config/database.yml to your liking
1. ~$ rake db:create~
1. ~$ rake db:schema:load~
1. Add a user and some templates (through console for now)
  - ~$ rails c~
  - ~> me = User.create! email: <your email>, password: <your password>~
  - ~> me.templates.create! template: * "%a\n  %u %?", properties: {description: 'Bookmark Entry', hotkey: 'b'}~
  - etc.

*** Setup (Frontend)
1. ~$ npm install~
2. ~$ webpack~

*** Dev Servers
1. ~$ rails s~
1. ~$ webpack-dev-server~

Browse the site at [[http://localhost:3001]]

** Copyright
Copyright (C) 2016 Jon Raphaelson <jon@accidental.cc>
This program is released under the terms of the [[LICENSE.txt][GPLv3 license]].

** Planning
*** TODO implement capture template configuration
- parse org-capture mode syntax
*** TODO implement JWT token login (for limited scoped access)
*** TODO implement bookmarklets / plugins
- chrome/firefox/etc. extensions that could send text/reminders, etc.
- server side handling for incoming email / sms

** Examples
*** [[http://usesthis.com/interviews/][UsesThis: famous people doing things]]
    :PROPERTIES:
    :WEBCAPTURE: ToxJZyEY26EtNt
    :CREATED:  2015-12-01
    :END:
    The thing with the guy is pretty cool, you know?

** Notes
The way this will end up working:

- capture an item via bookmarklet, plugin or whatever (email, sms, bookmarks)
- store that item in the database (encrypted would be nice)
- have a uri that can be used to fetch an *org-mode formatted* file with your captures
- elisp package to:
  + fetch that file & cache it locally
  + start refiling the entries elsewhere
  + when an entry is refiled away, remove it from the list on the server?

The idea is that there's this magical, auto-updating capture target in the sky, and whatever you would like to push to it you can, and then when you're at your workstation, you can pull down and refile your notes to your heart's content.
