README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>WebCapture</title>
<!-- 2015-12-15 Tue 15:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">WebCapture</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Running</a>
<ul>
<li><a href="#sec-1-1">1.1. Prerequisites</a></li>
<li><a href="#sec-1-2">1.2. Setup (API)</a></li>
<li><a href="#sec-1-3">1.3. Setup (Frontend)</a></li>
<li><a href="#sec-1-4">1.4. Dev Servers</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Copyright</a></li>
<li><a href="#sec-3">3. Planning</a>
<ul>
<li><a href="#sec-3-1">3.1. <span class="todo TODO">TODO</span> implement capture template configuration</a></li>
<li><a href="#sec-3-2">3.2. <span class="todo TODO">TODO</span> implement JWT token login (for limited scoped access)</a></li>
<li><a href="#sec-3-3">3.3. <span class="todo TODO">TODO</span> implement bookmarklets / plugins</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Examples</a>
<ul>
<li><a href="#sec-4-1">4.1. UsesThis: famous people doing things</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Notes</a></li>
</ul>
</div>
</div>
<p>
Org-mode capture templates from wherever.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Running</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Prerequisites</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>ruby/bundler (developed and tested against ruby-2.2.0)
</li>
<li>node/npm     (developed and tested against npm-3.4.1)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Setup (API)</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li><code>$ bundle install</code>
<ul class="org-ul">
<li>this can fail if you don't have postgres installed, try removing <code>pg</code> from the Gemfile, and edit <code>config/database.yml</code> to be sqlite, or whatever.
</li>
</ul>
</li>
<li>Edit config/database.yml to your liking
</li>
<li><code>$ rake db:create</code>
</li>
<li><code>$ rake db:schema:load</code>
</li>
<li>Add a user and some templates (through console for now)
<ul class="org-ul">
<li><code>$ rails c</code>
</li>
<li><code>&gt; me = User.create! email: &lt;your email&gt;, password: &lt;your password&gt;</code>
</li>
<li><code>&gt; me.templates.create! template: * "%a\n  %u %?", properties: {description: 'Bookmark Entry', hotkey: 'b'}</code>
</li>
<li>etc.
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Setup (Frontend)</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li><code>$ npm install</code>
</li>
<li><code>webpack</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Dev Servers</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li><code>$ rails s</code>
</li>
<li><code>$ webpack-dev-server</code>
</li>
</ol>

<p>
Browse the site at <a href="http://localhost:3001">http://localhost:3001</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Copyright</h2>
<div class="outline-text-2" id="text-2">
<p>
Copyright (C) 2016 Jon Raphaelson &lt;jon@accidental.cc&gt;
This program is released under the terms of the <i>GPLv3 license</i>.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Planning</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> implement capture template configuration</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>parse org-capture mode syntax
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> implement JWT token login (for limited scoped access)</h3>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> implement bookmarklets / plugins</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>chrome/firefox/etc. extensions that could send text/reminders, etc.
</li>
<li>server side handling for incoming email / sms
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Examples</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <a href="http://usesthis.com/interviews/">UsesThis: famous people doing things</a></h3>
<div class="outline-text-3" id="text-4-1">
<p>
The thing with the guy is pretty cool, you know?
</p>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Notes</h2>
<div class="outline-text-2" id="text-5">
<p>
The way this will end up working:
</p>

<ul class="org-ul">
<li>capture an item via bookmarklet, plugin or whatever (email, sms, bookmarks)
</li>
<li>store that item in the database (encrypted would be nice)
</li>
<li>have a uri that can be used to fetch an <b>org-mode formatted</b> file with your captures
</li>
<li>elisp package to:
<ul class="org-ul">
<li>fetch that file &amp; cache it locally
</li>
<li>start refiling the entries elsewhere
</li>
<li>when an entry is refiled away, remove it from the list on the server?
</li>
</ul>
</li>
</ul>

<p>
The idea is that there's this magical, auto-updating capture target in the sky, and whatever you would like to push to it you can, and then when you're at your workstation, you can pull down and refile your notes to your heart's content.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-12-15 Tue 15:26</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
